//TODO:
//Реализация удаления и добавления в избранное товаров из блока missing     СДелано
//Сделать так чтоб при нажатии на карточку checkbox работал
//Оживить счетчик кол-ва товаров у всех price cart
//Оживить сумму карточек когда счетчик меняется
//Сделать по макету валидацию формы: описание ошибки
//Сделать рабочими чекбоксы и сделать кастомные checkbox
//Реализаци модалки при нажатии кнопки "Изменить" у блоков: Способ доставки, способ оплаты
//Сделать адаптивный весь макет
//Реализация модалки при наведении на иконку карточки !
